[
    {
        "title": "Female newly diagnosed with MS",
        "postText": "I’m a 52 year old woman who was just diagnosed with MS within the last year. I am looking for advice on managing symptoms from other women my age who have been living with this.",
        "username": "Mary",
        "groupName": "Chronic",
        "comments": [
            {
                "commentText": "Hello Mary, welcome to the group. In my experience the biggest recommendation is managing your daily habits and routines. This has proven to have long term benefits. Check out this self assessment quiz to identify areas where you can adjust your habits to help with symptoms. https://www.everydayhealth.com/multiple-sclerosis/assess-lifestyle-habits/",
                "username": "Marge"
            },
            {
                "commentText": "Hi Mary! I live in NY close to this facility. They have a lot of good resources that have helped me understand and live with MS. NYU Langone Health Multiple Sclerosis Comprehensive Care Center in NYC.",
                "username": "NYLady"
            }
        ]
    },

    {
        "title": "Prostate Cancer Recurrence",
        "postText": "7 years ago I had an prostatectomy and just found out that my prostate cancer has returned. This seems like a rare occurrence and I was wondering if anyone else has had experience with this.",
        "username": "Bill",
        "groupName": "Chronic",
        "comments": [
            {
                "commentText": "This actually isn’t as rare as you might think. I had a similar experience where I underwent prostatectomy with subsequent chemotherapy and my PSA levels dropped to an acceptable level. They have since started rising again.",
                "username": "Bob"
            },
            {
                "commentText": "I also had a recurrence. Mine came back in the surrounding lymph nodes and affected the muscles in the surrounding area.",
                "username": "Oldman"
            }
        ]
    },
    {
        "title": "Long Term Type 1 Diabetes",
        "postText": "I was diagnosed with type 1 diabetes when I was 6 years old. I am currently spending about $50 a month on insulin with insurance. Is this close to what everyone else is spending? It sure adds up over a lifetime of use. Does anyone have suggestions on getting more affordable insulin.",
        "username": "Nicole",
        "groupName": "Chronic",
        "comments": [
            {
                "commentText": "I pay about $35 a month through my insurance. It seems to very quite a bit depending on provider. It might be good to shop around to look at prices. If you qualify for Medicaid/Medicare, that will probably be the cheapest way.",
                "username": "Stef"
            },
            {
                "commentText": "Getinsulin.org is a service that can match you with ways to afford your insulin. You will need to provide your prescription, income, insurance information and location to match with programs that can help you.",
                "username": "Peter"
            }
        ]
    },
    {
        "title": "Grieving the loss of who my husband was",
        "postText": "I’m a 44 year old mother of 2. My husband was recently in a car accident and suffered a traumatic brain injury. He has survived but will have lifelong impairments requiring full time care. I am reaching out looking for words of encouragement and support from people who have gone through something similar. ",
        "username": "Marriedandlonely",
        "groupName": "Grief",
        "comments": [
            {
                "commentText": "I’m so sorry to hear about your loss. My husband was injured in a severe motorcycle accident 5 years ago and I am his full time care giver. What I have learned through this experience, is that I need to still take care of myself and take time away for my own mental health.",
                "username": "Kara"
            },
            {
                "commentText": "My husband sustained a TBI in a work related injury. You try to do everything and give everting right away, but you have to pace yourself. This is a long term issue and you don’t want to burn yourself out early. It is ok to ask for help so you can take care of yourself too.",
                "username": "Becca"
            }
        ]
    },
    {
        "title": "Friend Gone - Now What",
        "postText": "3 years ago, my best friend committed suicide following a long history with mental illness. I still find that I am dealing with the emotional affects of this on almost a daily basis. Has anyone found their own ways to cope or sought professional counseling for this type of grief? Just writing about this is hard to do.",
        "username": "Nick",
        "groupName": "Grief",
        "comments": [
            {
                "commentText": "My brother committed suicide 8 years ago which came as a total shock to our family because he was smart and a successful young professional going into engineering. Apparently the stress and his mental health became too much to handle. Every year on his birthday my family and I publicly celebrate his life and encourage everyone to share pictures and stories about him. My suggestion to you is to find ways to celebrate the person you cared so much about.",
                "username": "CJ"
            },
            {
                "commentText": "I lost my dad to suicide 10 years ago. He was a police officer, husband, father of 3, grandfather of 2. I too find myself struggling to accept this loss even after so long. I have found great local councilors through the psychology today website. You can read about therapists and can find one that fits your personality.",
                "username": "Frank"
            }
        ]
    },
    {
        "title": "Doctors have emotions too",
        "postText": "I have been a practicing ER physician for the past 11 years. Whenever I lose a patient it is like the first time all over again. People assume doctors get used to death but I experience extreme grief with every patient I lose. I am not sure if this is a normal experience this late in your career. Looking for colleagues advice on how to cope with losing patients. Starting to wonder if this job is still right for me.",
        "username": "ERdoc",
        "groupName": "Grief",
        "comments": [
            {
                "commentText": "I am a home hospice nurse of 6 years. It take a unique person to deal with this amount of death. Do you have any outlets? Are you seeking any emotional support help? I have found going to team lead and  debriefing is a good way to process through the experience. ",
                "username": "Mannurse"
            },
            {
                "commentText": "I also find this hard to deal with. I am a cardiac physician and been practicing for 26 years. It is a normal process to learn how to cope with loss and guilt. I think that it shows you are an empathetic human which probably indicates you are a good doctor. I would recommend reaching out to a professional to seek guidance on how to best manage these feelings.",
                "username": "Fixerofhearts"
            }
        ]
    },
    {
        "title": "AA Alternative",
        "postText": "What other options are there for alcoholism support? I tried AA and it just wasn’t for me. Anyone experience a good alternative?",
        "username": "Mary",
        "groupName": "Addiction",
        "comments": [
            {
                "commentText": "I have a cousin that use the Ria Health program and had success. They use medication, coaching, tracking tools, support groups, and even have telemedicine options.",
                "username": "Bill"
            },
            {
                "commentText": "I also tried AA and didn’t like the religious aspect to it. Apparently there’s something called “Secular AA” which is like a subgroup the helps all kinds of people regardless of their belief or lack of belief in a god. Maybe check that out if you got a weird vibe from traditional AA. Good luck!",
                "username": "Seth"
            }
        ]
    },
    {
        "title": "Family Intervention Suggestions",
        "postText": "My son is going through a lot right now and turning to drugs and alcohol as a coping mechanism. Our family and his friends are starting to get worried. Has anyone else staged an intervention? What’s the right way to do it? Did you seek outside guidance? Any ideas are welcome!",
        "username": "HelpfulParent",
        "groupName": "Addiction",
        "comments": [
            {
                "commentText": "If you go to the Substance Abuse and Mental Health Services Administration (SAMHSA) website, they have a National Helpline for referrals for both patients and families. They also have an online treatment locator. Hope you can find the help you need!",
                "username": "Pete"
            },
            {
                "commentText": "Check out this resource from Mayo Clinic. It lays out what you have to have in place before the intervention is initiated. Hope this helps! https://www.mayoclinic.org/diseases-conditions/mental-illness/in-depth/intervention/art-20047451",
                "username": "Marge"
            }
        ]
    },
    {
        "title": "Opioid Question",
        "postText": "Does anyone know of any FDA-approved medications for opioid use disorder? Do you have any experience taking them or know anyone who does?",
        "username": "CJ",
        "groupName": "Addiction",
        "comments": [
            {
                "commentText": "My boyfriend takes Buprenorphine. It reduces cravings and blocks the effects of opioids. Talk to your doctor about it and see if it’s ok for you to take; I believe there are some adverse drug interactions if you’re taking other meds.",
                "username": "Becca"
            },
            {
                "commentText": "Hi, I work at a clinic where our primary population is for recovering opioid addicts. There are 3 FDA approved medications: as mentioned above Buprenorphine, and the other two are Methadone (reduced opioid cravings and withdrawal) and Naltrexone (blocks euphoric and sedative effects of opioids). Always best to consult with a healthcare provider.",
                "username": "ERdoc"
            }
        ]
    },
    {
        "title": "Recent Car Crash Witness",
        "postText": "I witnessed a horrible car accident 2 weeks ago, and I still can’t get the images out of my head. I find myself thinking about it during the day and it’s keeping me up at night. What’s going on? Do I have PTSD?",
        "username": "Frank",
        "groupName": "Ptsd",
        "comments": [
            {
                "commentText": "I had a similar experience when I was the passenger in a car accident. I eventually had to seek counseling to work though it. I learned some techniques that I still implement when I get a flashback every now and then, but it’s slowly fading away. You should get help too!",
                "username": "Peter"
            },
            {
                "commentText": "Agreed with the commenter above. Working with a therapist, someone who specializes in cognitive-behavioral therapy, may be the best option for you. Sounds like you’re definitely having some post traumatic stress disorder symptoms.",
                "username": "Mary"
            }
        ]
    },
    {
        "title": "Military Support",
        "postText": "Calling all military brothers and sisters coming back into civilian life after deployment and not wanting to admit you probably have PTSD. How do you know if it’s bad enough? If I wait it out, it’ll likely go away right?",
        "username": "NYLady",
        "groupName": "Ptsd",
        "comments": [
            {
                "commentText": "Don’t wait! Get help. It’s not a weakness. This is a very real issue so many of us are plagued by. We have to talk about it and normalize it. If you let it go too long, it will consume your life; I’ve seen it happen too many times. ",
                "username": "Bob"
            },
            {
                "commentText": "I thought my flashbacks and nightmares would gradually go away the more I settled in to home life, focusing on my kids, and having work as a distraction. Nope. Didn’t happen. If anything my symptoms got worse before they got better with therapy because I just tried to ignore it and suppress it. Get help, man. Trust me.",
                "username": "Nicole"
            }
        ]
    },
    {
        "title": "Need to talk about Complex PTSD",
        "postText": "I feel like this topic may be taboo, but I suffer from complex PTSD, and wondering if there are others out there that have diagnosed with the same thing. It helps me to talk about my experiences, and the same friends and family are tired of listening to me, so I thought I’d try to find a new group that understands what I’m going through.",
        "username": "Stef",
        "groupName": "Ptsd",
        "comments": [
            {
                "commentText": "Hello! I’ve suffered from complex PTSD for the last 4 years. I know the feeling all too well of nobody can really understand what happened to you. You just go through you day trying to act normal, but this burden is always waying on us. I hear you, and I’m here to chat with whenever you need a listening ear!",
                "username": "KAra"
            },
            {
                "commentText": "Hi there – I’m so glad you started this thread! Finally! A group I can connect with! My story goes back to when I was a kid. I’m now in my early 20s and still dealing with the trauma of my childhood. It’s hard for me to form relationships with people in-person, so I’ve resorted to finding connections online; it feels safer for me. I’d be interested in keeping this thread going if others are!",
                "username": "Nick"
            }
        ]
    },
    {
        "title": "Amputee!",
        "postText": "Raise your hand if you’re an upper extremity amputee! Haha just a little limb humor there. Reaching out to the hive mind to try to collect some new ideas for devices to help with ADLs (i.e. dressing, grooming, self-care, etc.) Show me all your cool gizmos and gadgets!",
        "username": "Mannurse",
        "groupName": "Physical",
        "comments": [
            {
                "commentText": "Hey there! I love to cook, but when I had to have my right hand removed following a traumatic injury, I had to find a new way to do my slicing and dicing. Do a Google search for a “Rocking T Knife”. Life-changing!",
                "username": "OneArmed"
            },
            {
                "commentText": "Dycem. Look it up. It’ll be your best friend. Stops anything from slipping and sliding when you only have one hand to keep things in place!",
                "username": "helpmyself"
            }
        ]
    },
    {
        "title": "Post Stroke Mobility",
        "postText": "Hello forum. I was wondering if someone could share their experience with walking following a stroke. My husband suffered a right hemisphere stroke about a month ago, and is just now starting to practice standing. What can I expect?",
        "username": "StrokeWife",
        "groupName": "Physical",
        "comments": [
            {
                "commentText": "As a physical therapist and a daughter to a dad who just went through a stroke, he needs to learn how to bear weight through his leg first. The brain needs to get input back through those leg muscles so they wake up and remember when they’re meant to do. Once he can stand and regain balance, then his therapists will work on walking. He will likely need a leg brace and possibly a device to help with his balance. It’s a long road, but he’ll get there!",
                "username": "Seth"
            },
            {
                "commentText": "My brother is currently in rehab following a left hemisphere stroke, and his therapy team straps him into a harness on a track that helps support his weight but allows him to safely practice being on his feet. Pretty cool technology. Hopefully your husband will go somewhere that has a similar system to help him when he’s ready.",
                "username": "Fixerofhearts"
            }
        ]
    },
    {
        "title": "Laryngectomy ",
        "postText": "I’m a 60 yo retired drama teacher, and I just had to have a total laryngectomy (aka they took out my voice box) due to throat cancer. It’s devastating losing something that was my livelihood. I’m now trying to find support and meaning in other activities that I can express myself through.",
        "username": "Dramateach",
        "groupName": "Physical",
        "comments": [
            {
                "commentText": "I feel your loss, grief, and pain. I too had a laryngectomy after years of smoking; it finally caught up with me. I loved to sing in our local community choir, but found new joy in helping with the administrative work researching, ordering, studying, and preparing new pieces for the group. It still allows me to be involved even though I can no longer sing. Try to find a new aspect of something you love.",
                "username": "exsmoker"
            },
            {
                "commentText": "Have you seen the new documentary that Val Kilmer put out? It’s his story told by his son but as Val in first person. Super interesting. I think he had a total laryngectomy too even though they don’t actually call it that. He’s quite the artist and collector – has found other art forms to express himself through outside of acting. This documentary has definitely put our disorder on society’s radar a bit more.",
                "username": "Mary"
            }
        ]
    },
    {
        "title": "Real OCD",
        "postText": "I’m an adult male who suffers from OCD. I feel like this disorder is an over-used, mainstream term for anyone who likes things a certain way, and it is often associated with women, but this is a very real, professionally diagnosed disorder. Are there any other men out there struggling with this?",
        "username": "OCDer",
        "groupName": "Mental",
        "comments": [
            {
                "commentText": "Hi, fellow obsessor. Yup, I’m a dude, and I too have been diagnosed with OCD. Mine started as a kid, and luckily my parents were on it and got me in therapy right away to help cope with it in a health way. Not sure if you’ve heard of exposure and response prevention therapy (ERP), but that worked/works for me if you’re looking for some help!",
                "username": "Livingwithocd"
            },
            {
                "commentText": "I can definitely relate to what you said about this term being mainstream and it really bothers me. I have a subtype of OCD called Harm OCD; I get easily overwhelmed by the idea of me or someone else getting hurt. People often think I’m just a overly cautious dad (something that doesn’t fit with my gender stereotype) but my anxiety can be totally debilitating.",
                "username": "CaringDad"
            }
        ]
    },
    {
        "title": "Just about everyone has something",
        "postText": "Hi – I’m new to this forum and just want to post something general about the idea that everyone has some form of mental illness. Do you agree?",
        "username": "Normalguy",
        "groupName": "Mental",
        "comments": [
            {
                "commentText": "I would agree with that. As “normal” as you think you are, everyone’s got SOMETHING going on. ",
                "username": "Bill"
            },
            {
                "commentText": "I disagree. I think there are people out there that are predisposed and/or have the neurologic wiring/neurochemical balance to be pretty “normal”. Nothing bothers them. They’re even-keeling and sort of happy-go-lucky. It might take a really significant event in their life to throw off that balance, but otherwise they don’t seem too bothered by any problem that comes their way.",
                "username": "Bob"
            }
        ]
    },
    {
        "title": "Alzheimer's....?",
        "postText": "I’m not sure this is a “Mental Illness” post, but it’s a disease of the brain, so I’m going to give it a go. My mom has recently started to decline mentally, to the point where me and my sister are deciding on if she should come live with one of us or go to a facility. Her doctor is saying early onset Alzheimer’s. She can get argumentative and combative even though I know she doesn’t realize she’s doing it. It’s such a challenging situation that I know so many people go through. I’m just looking for some advice or words of encouragement as we make our decision. Thanks in advance.",
        "username": "Mary",
        "groupName": "Mental",
        "comments": [
            {
                "commentText": "I’m so sorry to hear your mom’s mental health is declining; it’s so hard and sad to see our once vibrant parents turn into a shell of themselves. My brother and I took turns caring for our aging parents and kept them in their own home as long as possible, but eventually had them go live with my brother and his family because it made more sense in their location/situation. We just recently decided to put them in assisted living as the medical care got to be too much for us to handle. I feel like we did the best we good for them and that’s all you can do.",
                "username": "Marge"
            },
            {
                "commentText": "You are right, so many of us have been there. There’s never a “right” call on these things. Life circumstances are unique to every family, and you have to do what makes sense for you. Best of luck going through this next phase of life.",
                "username": "Nick"
            }
        ]
    }
]